---
kind: other
id: Methods.T:Autodesk.Revit.DB.WallFoundation
source: html/f6e3559d-7c3a-328c-220a-9265ddfd391f.htm
---
# WallFoundation Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.